// Copyright 2019 Scott Page

// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0

// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

{
  "signalr": {
    "label": {
        "type": "Type",
        "path": "Path",
        "host": "Host",
        "port": "Port",
        "hub": "Hub",
        "client": "Client",
        "responses": "Responses",
        "secure": "Secure"
    },
    "connectto": "Connect to",
    "sendrec": "Send/Receive",
    "payload": "payload",
    "message": "entire message",
    "tip": {
        "path1": "By default, <code>payload</code> will contain the data to be sent over, or received from a websocket. The listener can be configured to send or receive the entire message object as a JSON formatted string.",
        "path2": "This path will be relative to ",
        "host": "Host can be either an IP address or hostname.",
        "payload": "By default, <code>payload</code> will contain the data to be sent over, or received from a websocket. The client can be configured to send or receive the entire message object as a JSON formatted string.",
        "topic": "Topic is the method name, on the server, that will be invoked when this node receives an input message.  Leave it blank, and use msg.topic, to specify the method name at runtime."
    },
    "status": {
        "connected": "connected __count__",
        "connected_plural": "connected __count__"
    },
    "errors": {
        "connect-error": "An error occurred on the ws connection: ",
        "send-error": "An error occurred while sending: ",
        "missing-conf": "Missing server configuration",
        "duplicate-path": "Cannot have two WebSocket listeners on the same path: __path__"
    }
  }
}